БухЭксп/InformationRegisters/Отчетность24БРОПодключения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Отчетность24БРОПодключения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьПодтверждениеПользователя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Госорганы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/Отчетность24БРОПодключения/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИдентификаторБД = НРег(ОбщегоНазначения.КонтрольнаяСуммаСтрокой(
		Отчетность24БРО.ИдентификаторБазы()));
		
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ТекущийПользователь", 
		Пользователи.ТекущийПользователь());
	
	УстановитьУсловноеОформление();

КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокОбработкаЗапросаОбновления()
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбновлениеСписка = Новый ОписаниеОповещения("ОбновлениеСписка", ЭтотОбъект);
	
	Если Поле = Элементы.ПредставлениеОрганизации Тогда
		СтандартнаяОбработка = Ложь;
		
		Получатель = Элементы.Список.ТекущиеДанные.Получатель;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Получатель", Получатель);
		ПараметрыФормы.Вставить("ПолучитьСписок", Ложь);
		
		ОткрытьФорму("РегистрСведений.Отчетность24БРОПодключения.Форма.ФормаВыбораОрганизаций",
			ПараметрыФормы,
			ЭтотОбъект,
			УникальныйИдентификатор, , ,
			ОбновлениеСписка,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	ИначеЕсли Поле = Элементы.ПредставлениеПользователь Тогда
		СтандартнаяОбработка = Ложь;
		
		Получатель = Элементы.Список.ТекущиеДанные.Получатель;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Получатель", Получатель);
		
		ОткрытьФорму("РегистрСведений.Отчетность24БРОПодключения.Форма.ФормаВыбораПользователей",
			ПараметрыФормы,
			ЭтотОбъект,
			УникальныйИдентификатор, , ,
			ОбновлениеСписка,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Для Каждого Строка Из Строки Цикл
		
		Данные = Строка.Значение.Данные;
		// Пользователи
		Если Данные.Свойство("ПредставлениеПользователь") Тогда
			Если Данные.ЕстьТекущийПользователь Тогда
				Если Данные.КоличествоПользователей = 1 Тогда
					Данные.ПредставлениеПользователь = НСтр("ru='Только Вы'");
				Иначе
					Данные.ПредставлениеПользователь = НСтр("ru='Вы и еще'") 
					+ " " 
					+ ПолучитьСклоненияСтрокиПоЧислу("", 
					Данные.КоличествоПользователей - 1, "пользователь", "Л=ru_RU; ЧС=Количественное", "ПД=Именительный")[0];
				КонецЕсли;
			ИначеЕсли Данные.КоличествоПользователей = 0 Тогда
				Данные.ПредставлениеПользователь = НСтр("ru='Все'");
			Иначе
				Данные.ПредставлениеПользователь = ПолучитьСклоненияСтрокиПоЧислу("", 
				Данные.КоличествоПользователей, "пользователь", "Л=ru_RU; ЧС=Количественное", "ПД=Именительный")[0];
			КонецЕсли;
		КонецЕсли;
		
		// Организации
		Если Данные.КоличествоОрганизаций = 0 Тогда
			Данные.ПредставлениеОрганизации = НСтр("ru='Все'");	
		Иначе
			Данные.ПредставлениеОрганизации = ПолучитьСклоненияСтрокиПоЧислу("", 
			Данные.КоличествоОрганизаций, "организация", "Л=ru_RU; ЧС=Количественное", "ПД=Именительный")[0];
		КонецЕсли;
		
//		// Расположение
//		Если СтрНачинаетсяС(Данные.АдресПолучателя, "http") Тогда
//			АдресОблачная = Данные.АдресПолучателя;
//			Данные.ПредставлениеРасположение = АдресОблачная; 
//		Иначе
//			МассивЧастей = СтрРазделить(Данные.АдресПолучателя, """");
//			Если МассивЧастей.Количество() > 3 Тогда
//				ИмяСервераБазы = МассивЧастей[1];
//				ИмяБазы = МассивЧастей[3];
//				Данные.ПредставлениеРасположение = ИмяБазы + " " + НСТР("ru = 'на'") + " " + ИмяСервераБазы;
//			Иначе
//				ПутьФайловойБазы = МассивЧастей[1];
//				Данные.ПредставлениеРасположение = ПутьФайловойБазы; 
//			КонецЕсли;
//		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьСообщения(Команда)
	
	ИнтеграцияСОтчетность24Клиент.ПолучитьСообщенияПоHttp(Истина, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновлениеСписка(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Список.УсловноеОформление.Элементы.Очистить();

	/////////////////////////////////////////////////////////////////////
	Элемент = Список.УсловноеОформление.Элементы.Добавить();
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отправитель");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеСодержит;
	ОтборЭлемента.ПравоеЗначение = ИдентификаторБД;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);

	/////////////////////////////////////////////////////////////////////
	Элемент = Список.УсловноеОформление.Элементы.Добавить();
	НовоеПоле = Элемент.Поля.Элементы.Добавить();
	НовоеПоле.Использование = Истина;
	НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("Комментарий");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отправитель");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеСодержит;
	ОтборЭлемента.ПравоеЗначение = ИдентификаторБД;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПоясняющийОшибкуТекст);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Требуется переподключение!'"));
	
КонецПроцедуры

#КонецОбласти
